<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>

<HEAD>
  <TITLE>Sound - MPlayer - The Movie Player for Linux</TITLE>
  <LINK REL="stylesheet" TYPE="text/css" HREF="default.css">
  <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
</HEAD>

<BODY>

<H3><A NAME="audio">2.3.2 Audio-Ausgabe-Ger&auml;te</A></H3>

<H4><A NAME="sync">2.3.2.1 Audio-/VideoSynchronisation</A></H4>

<P>MPlayers Audio-Interface wird <I>libao2</I> genannt. Es enth&auml;lt 
zur Zeit diese Treiber:</P>

<DL>
  <DT>oss</DT>
  <DD>OSS (ioctl)-Treiber (unterst&uuml;tzt das Durchreichen von AC3)</DD>

  <DT>sdl</DT>
  <DD>SDL-Treiber (untertst&uuml;tzt Sound-D&auml;monen wie <B>ESD</B> und
    <B>ARTS</B>)</DD>

  <DT>nas</DT>
  <DD>NAS (Network Audio System)-Treiber</DD>

  <DT>alsa5</DT>
  <DD>ALSA 0.5-Treiber</DD>

  <DT>alsa9</DT>
  <DD>ALSA 0.9-Treiber (unterst&uuml;tzt das Durchreichen von AC3)</DD>

  <DT>sun</DT>
  <DD>SUN Audiotreiber (<CODE>/dev/audio</CODE>) f&uuml;r BSD und Solaris8</DD>

  <DT>arts</DT>
  <DD>ARTS-Treiber (haupts&auml;chlich f&uuml;r KDE-Benutzer)</DD>

  <DT>esd</DT>
  <DD>ESD-Treiber (haupts&auml;chlich f&uuml;r GNOME-Benutzer)</DD>
</DL>

<P>Linux-Soundkartentreiber haben Probleme mit der Kompatibilit&auml;t.
MPlayer benutzt einen in <EM>vern&uuml;nftig</EM> implementierten Treibern
eingebauten Mechanismus, um die Audio-/Video-Synchronisation korrekt
beizubehalten. Leider sind einige Treiberautoren nicht sonderlich gr&uuml;ndlich
bei der Implementation dieses Mechanismusses, da er nicht ben&ouml;tigt wird,
um MP3s abzuspielen oder Soundeffekte zu erzeugen.</P>

<P>Andere Medienplayer wie z.B. <A HREF="http://avifile.sourceforge.net">
aviplay</A> oder <A HREF="http://xine.sourceforge.net">xine</A> funktionieren
bei dir  wahrscheinlich so, wie sie sind, weil sie eine "simplere" Methode wie
internes  Timing f&uuml;r die Audio-/Video-Synchronisation verwenden.
Verschiedene Tests haben gezeigt, dass ihre Methoden nicht ganz so effizient
wie MPlayers Methoden sind.</P>

<P>Wenn du MPlayer zusammen mit einem korrekt geschriebenen 
Soundkartentreiber verwendest, dann wirst du niemals A/V-Desyncs aufgrund des 
Audiotreibers erleben (h&ouml;chstens mit sehr schlecht erstellten Dateien. 
Schau in einem solchen Fall in die Dokumentation, wie du das beheben 
kannst).</P>

<P>Wenn du einen solchen nicht gut implementierten Audiotreiber verwendest,
dann probier die Option <CODE>-autosync</CODE> aus, die deine Probleme
l&ouml;sen sollte. Schau in der man-Page nach; dort findest du mehr
Informationen dazu.</P>

<P>Einige Anmerkungen:</P>

<UL>
  <LI>Wenn du einen OSS-Treiber hast, versuche als erstes <CODE>-ao 
    oss</CODE> (dies ist die Standardeinstellung). Wenn du kleine Fehler, 
    Verz&ouml;gerungen oder irgendetwas anderes ungew&ouml;hliches h&ouml;rst, 
    versuche mal <CODE>-ao sdl</CODE> (HINWEIS: die SDL-Bibliotheken und das 
    dazugeh&ouml;rige Devel-Paket m&uuml;ssen installiert sein). Der SDL-
    Audiotreiber hilft in vielen F&auml;llen und unterst&uuml;tzt auch ESD
    (GNOME) und ARTS (KDE).</LI>
  <LI>Wenn du ALSA Version 0.5 verwendest, musst du fast immer <CODE>-ao 
    alsa5</CODE> verwenden, weil ALSA 0.5 einen fehlerhaften OSS-
    Emulationscode hat. MPlayer wird mit etwa so einer Meldung 
    <B>abst&uuml;rzen</B>:<BR> <CODE>DEMUXER: Too many (945 in 8390980 bytes) 
    video packets in the buffer!</CODE></LI>
  <LI>Unter Solaris solltest du den SUN-Audiotreiber mittels <CODE>-ao
    sun</CODE> benutzen, da ansonsten weder Video noch Audio funktionierne.</LI>
  <LI>Wenn beim Ton Klickger&auml;usche beim Abspielen vom CD-ROM-Laufwerk zu
    h&ouml;rne sind, dann schalte "IRQ unmasking" an, z.B. mit
    <CODE>hdparm -u1 /dev/cdrom</CODE> (<CODE>man hdparm</CODE>). Das ist auch
    generell von Vorteil, wie du in der
    <A HREF="cd-dvd.html#drives">CD-ROM-Sektion</A> nachleesn kannst.</LI>
</UL>


<H4><A NAME="experiences">2.3.2.2 Soundkarten-Erfahrungen, 
-Empfehlungen</A></H4>

<P>Unter Linux wird ein 2.4.x Kernel sehr empfohlen. Kernel 2.2 wird nicht
getestet.</P>

<P>Linux-Soundtreiber werden haupts&auml;chlich von der freien Version von
OSS bereitgestellt. Diese Treiber werden inzwischen von denen des
<A HREF="http://www.alsa-project.org">ALSA-Projektes</A> abgel&ouml;st
(Advanced Linux Sound Architecture), die bereits im Entwicklerbaum des Kernels
(2.5) zu finden sind. Wenn deine Distribution nicht bereits ALSA verwendet
und du Probleme mit dem Sound hast, dann solltest du die ALSA-Treiber mal
ausprobieren. Die ALSA-Treiber sind den OSS-Treibern meistens in Sachen
Kompatibilit&auml;t, Performance und Featuren &uuml;berlegen. Ledier werden
einige Soundkarten dagegen nur von OSS-Treibern von
<A HREF="http://www.opensound.com/">4Front Technologies</A> unterst&uuml;tzt.
Sie unterst&uuml;tzen ebenfalls einige Nicht-Linux-Systeme.</P>

<TABLE BORDER="1" WIDTH="100%">

  <TR>
    <TH ROWSPAN="2"><B>SOUNDKARTE</B></TH>
    <TH COLSPAN="4"><B>TREIBER</B></TH>
    <TH ROWSPAN="2"><B>Max kHz</B></TH>
    <TH ROWSPAN="2"><B>Max Anz. Kan&auml;le</B></TH>
    <TH ROWSPAN="2"><B>Max Anz. gleichzeitiger Zugriffe<FONT SIZE="-2"><A HREF="#note1">[1]</A></FONT></B></TH>
  </TR>

  <TR>
    <TH><B>OSS/Free</B></TH>
    <TH><B>ALSA</B></TH>
    <TH><B>OSS/Pro</B></TH>
    <TH><B>andere</B></TH>
  </TR>

  <TR>
    <TD><B>VIA onboard (686/A/B, 8233, 8235)</B></TD>
    <TD><A HREF="http://sourceforge.net/project/showfiles.php?group_id=3242&amp;release_id=59602">via82cxxx_audio</A></TD>
    <TD>snd-via82xx</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
    <TD>4-48 kHz oderr nur 48 kHz, abh&auml;ngig vom Chipsatz</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>

  <TR>
    <TD><B>Aureal Vortex 2</B></TD>
    <TD>keine</TD>
    <TD>keine</TD>
    <TD>OK</TD>
    <TD><A HREF="http://aureal.sourceforge.net">Linux Aureal-Treiber</A><BR>
      <A HREF="http://makacs.poliod.hu/~pontscho/aureal/au88xx-1.1.3.tar.bz2">buffer size increased to 32k</A></TD> 
    <TD>48</TD>
    <TD>4.1</TD>
    <TD>5+</TD>
  </TR>

  <TR>
    <TD><B>SB Live!</B></TD>
    <TD>Analog OK, SP/DIF funktioniert nicht</TD>
    <TD>beide OK</TD>
    <TD>beide OK</TD>
    <TD><A HREF="http://opensource.creative.com">Creatives OSS-Treiber (mit SP/DIF-Unterst&uuml;tzung)</A></TD>
    <TD>192</TD>
    <TD>4.0/5.1</TD>
    <TD>32</TD>
  </TR>

  <TR>
    <TD><B>SB 128 PCI (es1371)</B></TD>
    <TD>OK</TD>
    <TD>?</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
    <TD>48</TD>
    <TD>stereo</TD>
    <TD>2</TD>
  </TR>

  <TR>
    <TD><B>SB AWE 64</B></TD>
    <TD>max 44kHz</TD>
    <TD>48kHz klingt schlecht</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
    <TD>48</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>

  <TR>
    <TD><B>GUS PnP</B></TD>
    <TD>keine</TD>
    <TD>OK</TD>
    <TD>OK</TD>
    <TD>&nbsp;</TD>
    <TD>48</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>
  
  <TR>
    <TD><B>Gravis UltraSound ACE</B></TD>
    <TD>nicht OK</TD>
    <TD>OK</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
    <TD>44</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>
  
  <TR>
    <TD><B>Gravis UltraSound MAX</B></TD>
    <TD>OK</TD>
    <TD>OK (?)</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
    <TD>48</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>
  
  <TR>
    <TD><B>ESS 688</B></TD>
    <TD>OK</TD>
    <TD>OK (?)</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
    <TD>48</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>
  
  <TR>
    <TD><B>C-Media-Karten (welche genau?)</B></TD>
    <TD>nicht OK (zischt) (?)</TD>
    <TD>OK</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
    <TD>?</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>
  
  <TR>
    <TD><B>Yamaha-Karten (*ymf*)</B></TD>
    <TD>nicht OK (?) (vielleicht mit <CODE>-ao sdl</CODE>)</TD>
    <TD>nur mit der OSS-Emulation von ALSA 0.5 OK <B>UND</B>
      <CODE>-ao sdl</CODE> (!) (?)</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
    <TD>?</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>
  
  <TR>
    <TD><B>Karten mit envy24-Chips (wie z.B. Terratec EWS88MT)</B></TD>
    <TD>?</TD>
    <TD>?</TD>
    <TD>OK</TD>
    <TD>&nbsp;</TD>
    <TD>?</TD>
    <TD>&nbsp;</TD>
    <TD>&nbsp;</TD>
  </TR>

  <TR>
    <TD><B>PC-Lautsprecher oder DAC</B></TD>
    <TD>OK</TD>
    <TD>none</TD>
    <TD>&nbsp;</TD>
    <TD><A HREF="http://www.geocities.com/stssppnn/pcsp.html">OSS-Treiber f&uuml;r den PC-Lautsprecher</a></TD>
    <TD>Der Treiber emuliert 44.1, vielleicht auch mehr.</TD>
    <TD>mono</TD>
    <TD>1</TD>
  </TR>

</TABLE>

<P><A NAME="note1"><B>[1]</B></A>: Die Anzahl der Anwendungen, die <I>zur
gleichen Zeit</I> auf das Ger&auml;t zugreifen k&ouml;nnen.</P>

<P>R&uuml;ckmeldungen zu diesem Dokument sind willkommen. Bitte sag uns, wie 
MPlayer und deine Soundkarte(n) zusammen funktionieren.</P>

<H4><A NAME="af">2.3.2.3 Audiofilter</A></H4>

<P>Die alten Audioplugins wurden von einer neuen Filterschicht abgel&ouml;st.
Audiofilter werden benutzt, um die Parameter der Daten zu &auml;ndern, bevor
sie die Soundkarte erreichen. Die Aktivierung der Filter geschieht normalerweise
automatisch, kann aber auch erzwungen oder verhindert werden. Die Filter
werden aktiviert, wenn die Parameter der Daten von denen der Soundkarte
abweichen und deaktiviert, wenn sie gleich sind. Die Option <CODE>-af
filter1,filter2,...</CODE> wird benutzt, um Filter einzuf&uuml;gen, die nicht
automatisch eingef&uuml;gt werden. Diese Filter werden in der Reihenfolge
abgearbeitet, wie sie angegeben wurden.</P>

<P>Beispiele:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af resample,pan movie.avi </CODE></P>

<P>Schickt die Audiodaten durch das Resample-Filter und danach durch den
Pan-Filter. Die Liste darf keine Leerzeichen enthalten, sonst klappt's nicht.
</P>

<P>Viele Filter kennen Parameter, mit denen ihr Verhalten ge&auml;ndert werden
kann. Diese Parameter werden unten detailliert beschrieben. Wenn keine
Parameter angegeben werden, dann verwendet der Filter seine Standardwerte. Hier
ist ein Beispiel, wie Filter mit Parametern verwendet werden k&ouml;nnen:</P>

<P>&nbsp;&nbsp;<CODE>mplayer -af resample=11025,pan=1:0.5:0.5 -channels 1
  -srate 11025 media.avi</CODE></P>

<P>Das setzt die Ausgabefrequenz des Resampleplugins auf 11025Hz und
downmixt das Audio auf einen Kanal mit dem Pan-Filter.</P>

<P>Die allgemeine Kontrolle der Filterschicht geschieht &uuml;ber
<CODE>-af-adv</CODE>. Diese Option kennt zwei Parameter:</P>

<DL>
  <DT><CODE>force</CODE><DT>
  <DD>ist ein Bitfeld, das angibt, wie die Filter
    einzuf&uuml;gen sind und welche Geschwindigkeits-/Genauigkeitsoptimierungen
    sie verwenden:
    <DL>
      <DT><CODE>0</CODE></DT>
      <DD>Benutzt automatisches Einf&uuml;gen und optimiert in Abh&auml;ngigkeit
        der CPU-Geschwindigkeit.</DD>
      <DT><CODE>1</CODE></DT>
      <DD>Benutzt automatisches Einf&uuml;gen und optimiert f&uuml;r die
        h&ouml;chstm&ouml;gliche Geschwindigkeit.<BR>
        <EM>Warnung:</EM> Einige
        Features der Audiofilter werden kommentarlos deaktiviert, und die
        Soundqualit&auml;t k&ouml;nnte niedriger sein als erwartet.</DD>
      <DT><CODE>2</CODE></DT>
      <DD>Benutzt automatisches Einf&uuml;gen der Filter und optimiert f&uuml;r
        Qualit&auml;t.</DD>
      <DT><CODE>3</CODE></DT>
      <DD>F&uuml;t nicht automatisch Filter ein.<BR>
        <I>Warnung:</I> Hiermit kann
        MPlayer eventuell zum Absturz gebracht werden.</DD>
      <DT><CODE>4</CODE></DT>
      <DD>F&uuml;gt automatisch Filter so wie bei 0 hinzu, benutzt aber
        Flie&szlig;kommaarithmetik, wo dies m&ouml;glich ist.</DD>
      <DT><CODE>5</CODE></DT>
      <DD>F&uuml;gt automatisch Filter so wie bei 1 hinzu, benutzt aber
        Flie&szlig;kommaarithmetik, wo dies m&ouml;glich ist.</DD>
      <DT><CODE>6</CODE></DT>
      <DD>F&uuml;gt automatisch Filter so wie bei 2 hinzu, benutzt aber
        Flie&szlig;kommaarithmetik, wo dies m&ouml;glich ist.</DD>
      <DT><CODE>7</CODE></DT>
      <DD>F&uuml;gt keine Filter automatisch hinzu, benutzt aber
        Flie&szlig;kommaarithmetik, wo dies m&ouml;glich ist.</DD>
    </DL>
  </DD>

  <DT><CODE>list</CODE></DT>
  <DD>Dies ist ein Synonym f&uuml;r <CODE>-af</CODE>.</DD>
</DL>

<P>Die Filterschicht wird auch von den folgenden allgemeinen Optionen
beeinflusst:</P>

<DL>
  <DT><CODE>-v</CODE></DT>
  <DD>Gibt ausf&uuml;hrlichere Meldungen aus. Die meisten Filter geben hiermit
    auch mehr Statusinformationen aus.</DD>
  <DT><CODE>-channels</CODE></DT>
  <DD>Diese Option setzt die Anzahl der Ausgabekan&auml;le, die du von deiner
    Soundkarte ausgegeben haben m&ouml;chtest. Sie beeinflusst auch die Anzahl
    der Kan&auml;le, die
    vom Quellstream decodiert werden. Wenn der Stream weniger als die hiermit
    geforderte Anzahl Kan&auml;le enth&auml;lt, so werden automatisch
    Filter eingef&uuml;gt (siehe unten). Das Routing ist das Standardrouting
    des channels-Filters.</DD>
  <DT><CODE>-srate</CODE></DT>
  <DD>Diese Option gibt die Samplerate an, die die Soundkarte benutzen soll,
    sofern sie diese Rate unterst&uuml;tzt.
    Wenn die Samplefrequenz deiner Soundkarte anders ist als die des aktuellen
    Quellstreams, so wird der resample-Filter (siehe unten) automatisch
    eingef&uuml;gt, um diese Differenz auszugleichen.</DD>
  <DT><CODE>-format</CODE><DT>
  <DD>Diese Option setzt das Sampleformt zwischen Audiofilterschicht und der
    Soundkarte. Wenn das angeforderte Format der Soundkarte nicht das gleiche
    wie das des Quellstreams ist, dann wird der format-Filter (siehe unten)
    automatisch eingef&uuml;gt, um das Format zu konvertieren.</DD>
</DL>


<H4><A NAME="af_resample">2.3.2.3.1 Up/Down-sampling</A></H4>

<P>MPlayer unterst&uuml;tzt vollst&auml;ndig Up-/Downsampling mit dem
resample-Filter. Dieser Filter kann benutzt werden, wenn du eine Soundkarte
hast, die nur eine feste Frequenz unterst&uuml;tzt, oder die nur maximal
44.1kHz unterst&uuml;tzt. Dieser Filter wird automatisch aktiviert, wenn er
ben&ouml;tigt wird. Er kann aber auch explizit auf der Kommandozeile aktiviert
werden. Er kennt drei Optionen:</P>

<DL>
  <DT><CODE>srate &lt;8000-192000&gt;</CODE></DT>
  <DD>wird benutzt, um die Ausgabesmaplefrequenz in Hz anzugeben. Der
    g&uuml;ltige Bereich liegt zwischen 8kHz und 192kHz. Wenn Eingangs-
    und Ausgabefrequenz gleich sind, oder wenn dieser Parameter nicht angegeben
    wurde, so wird der Filter wieder entladen. Hohe Samplefrequenzen verbessern
    normalerweise die Audioqualit&auml;t, vor allem, wenn auch andere
    Filter benutzt werden.</DD>

  <DT><CODE>sloppy</CODE></DT>
  <DD>Mit dieser Option wird zugelassen, dass die Ausgabefrequenz leicht von
    der geforderten Frequenz (<CODE>srate</CODE>) abweicht. Diese Option
    kann benutzt werden, wenn das Playback nur sehr langsam startet.
    Diese Option ist standardm&auml;&szlig;ig aktiviert.</DD>

  <DT><CODE>type &lt;0-2&gt;</CODE><DT>
  <DD>ist ein optional anzugebender Integer zwischen <CODE>0</CODE> und
    <CODE>2</CODE>, der den zu benutzenden Resamplealgorithmus ausw&auml;hlt.
    Hier w&auml;hlt <CODE>0</CODE> lineare Interpolation und <CODE>1</CODE>
    mehrphasige Filterb&auml;nke mit Ganzahlarithmetik. <CODE>2</CODE>
    w&auml;hlt mehrphasige Filterb&auml;nke mit Flie&szlig;kommaarithmetik.
    Lineare Interpolation ist sehr schnell, liefert daf&uuml;r aber auch
    schlechte Qualit&auml;t, vor allem, wenn sie benutzt wird, um die
    Samplerate zu erh&ouml;hen. Die beste Qualit&auml;t liefert <CODE>2</CODE>.
    Daf&uuml;r ben&ouml;tigt sie aber auch die meiste CPU-Zeit.</DD>
</DL>

<P>Beispiele:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af resample=44100:0:0</CODE></P>

<P>Dies setzt die Ausgabefrequenz des Resample-Filters auf exakt 44100Hz
mit linearer Interpolation.</P>


<H4><A NAME="af_channels">2.3.2.3.2 &Auml;ndern der Anzahl der Kan&auml;le</A>
</H4>

<P>Der <CODE>channels</CODE>-Filter kann benutzt werden, um Kan&auml;le
hinzuzuf&uuml;gen oder zu entfernen. Er kann auch benutzt werden, um
Kan&auml;le umzuleiten oder sie zu kopieren. Er wird automatisch aktiviert,
falls die Anzahl der Kan&auml;le bei Eingang und Ausgang der Audiofilterschicht
unterschiedlich ist, oder wenn ein anderer Filter diesen Filter ben&ouml;tigt.
Wenn er nicht gebraucht wird, so entl&auml;dt sich dieser Filter automatisch.
Die Anzahl der Parameter ist dynamisch:</P>

<DL>
  <DT><CODE>nch &lt;1-6&gt;</CODE></DT>
  <DD>ist eine ganze Zahl zwischen <CODE>1</CODE> und <CODE>6</CODE>, die die
    Anzahl der Ausgabekan&auml;le festlegt. Dieser Parameter wird
    ben&ouml;tigt. Wenn er weggelassen wird, dann erh&auml;lt man einen
    Laufzeitfehler.</DD>

  <DT><CODE>nr &lt;1-6&gt;</CODE></DT>
  <DD>ist eine ganze Zahl zwischen <CODE>1</CODE> und <CODE>6</CODE>, die die
    Anzahl der Umleitungen
    festlegt. Dieser Parameter ist optional. Wenn er weggelassen wird, dann
    werden keine Umleitungen vorgenommen.</DD>

  <DT><CODE>von1:nach1:von2:nach2:von3:nach3...</CODE></DT>
  <DD>sind paare von Nummern zwischen <CODE>0</CODE> und <CODE>5</CODE>, die
    festlegen, wohin jeder Kanal umgeleitet werden soll.</DD>
</DL>

<P>Wenn nur <CODE>nch</CODE> angegeben wird, dann werden die
Standardumleitungen benutzt, die so aussehen: Wenn mehr Ausgabekan&auml;le
gefordert sind als Eingangskan&auml;le existieren, so werden leere Kan&auml;le
erzeugt (bis auf's Mixen von Mono auf Stereo: hier wird der Monokanal auf beide
Kan&auml;le kopiert). Ist die Anzahl dagegen kleiner, so werden die
&uuml;bersch&uuml;ssigen Kan&auml;le entfernt.</P>

<P>Beispiel 1:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af channels=4:4:0:1:1:0:2:2:3:3 media.avi </CODE></P>

<P>&Auml;ndert die Anzahl der Kan&auml;le auf 4 und legt vier Routen fest, die
die Kan&auml;le 0 und 1 vertauschen und die Kan&auml;le 2 und 3 intakt lassen.
Wenn die Quelldatei nur zwei Kan&auml;le hat, so sind die Kan&auml;le 2 und 3
leise, aber 0 und 1 werden trotzdem vertauscht.</P>

<P>Beispiel 2:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af channels=6:4:0:0:0:1:0:2:0:3 media.avi </CODE></P>

<P>&Auml;ndert die Anzahl der Kan&auml;le auf 6 und gibt 4 Routen an, die Kanal
0 auf Kanal 0 und 3 kopieren. Die Kan&auml;le 4 und 5 bleiben stumm. </P>


<H4><A NAME="af_format">2.3.2.3.3 Formatkonvertierung</A></H4>

<P>Der <CODE>format</CODE>-Filter konvertiert zwischen verschiedenen
Sampleformaten. Er wird automatisch aktiviert, wenn er von der Soundkarte
oder einem anderen Filter ben&ouml;tigt wird.</P>

<DL>
  <DT><CODE>bps &lt;Nummer&gt;</CODE></DT>
  <DD>kann <CODE>1</CODE>, <CODE>2</CODE> oder <CODE>4</CODE> sein und gibt die
    Anzahl der Bytes pro Sample an.
    Dieser Parameter wird ben&ouml;tigt und f&uuml;hrt zu einem Laufzeitfehler,
    wenn er weggelassen wird.</DD>

  <DT><CODE>f &lt;format&gt;</CODE></DT>
  <DD>ist ein Textstring, der das Sampleformat beschreibt. Der String besteht
    aus einem Mix der folgenden Schl&uuml;sselw&ouml;rter:
    <CODE>alaw</CODE>, <CODE>mulaw</CODE> oder
    <CODE>imaadpcm</CODE>, <CODE>float</CODE> oder <CODE>int</CODE>,
    <CODE>unsigned</CODE> oder <CODE>signed</CODE>, <CODE>le</CODE> oder
    <CODE>be</CODE> (little oder big endian).
    Dieser Parameter wird ben&ouml;tigt und f&uuml;hrt zu einem Laufzeitfehler,
    wenn er weggelassen wird.</DD>
</DL>

<P>Beispiel:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af format=4:float media.avi</CODE></P>

<P>setzt das Ausgabeformat auf 4 Bytes pro Sample Flie&szlig;kommadaten.</P>


<H4><A NAME="af_delay">2.3.2.3.4 Verz&ouml;gerung</A></H4>

<P>Der <CODE>delay</CODE>-Filter verz&ouml;gert den Sound auf dem Weg zum
Lautsprecher, damit die verschiedenen Kan&auml;le zur gleichen Zeit bei der
Sitzposition ankommen. Dieser Filter ist nur dann n&uuml;tzlich, wenn du mehr
als zwei Lautsprecher hast. Dieser Filter erh&auml;lt eine variable Anzahl
Parameter:</P>

<DL>
  <DT><CODE>d1:d2:d3...</CODE></DT>
  <DD>sind Flie&szlig;kommazahlen, die die Verz&ouml;gerung in ms f&uuml;r
    den jeweiligen Kanal angeben. Minimum ist 0ms, das Maximum 1000ms.</DD>
</DL>

<P>Um die ben&ouml;tigte Verz&ouml;gerung f&uuml;r die verschiedenen
Kan&auml;le zu berechnen, tu folgendes:</P>

<OL>
  <LI>Miss die Entfernung zwischen den Lautsprechern und deiner Sitzposition
    in Metern. Dies gibt dir die Distanzen s1 bis s5 (bei einem 5.1-System).
    Es lohnt sich nicht, auch f&uuml;r den Subwoofer zu kompensieren, weil
    man den Unterschied eh nicht h&ouml;rt.</LI>
  <LI>Subtrahiere die Distanzen s1 bis s5 von der maximalen Distanz, z.B.<BR>
    s[i] = max(s) - s[i]; i = 1...5</LI>
  <LI>Berechne die ben&ouml;tigte Verz&ouml;gerung wie folgt:<BR>
    d[i] = 1000*s[i]/342; i = 1...5 </LI>
</OL>

<P>Beispiel:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af delay=10.5:10.5:0:0:7:0 media.avi</CODE></P>

<P>verz&ouml;gert die Kan&auml;le vorne links und vorne rechts um 10.5ms,
die beiden hinteren Kan&auml;le um 0ms und den zentrierten Kanal um 7ms.</P>


<H4><A NAME="af_volume">2.3.2.3.5 Lautst&auml;rkekontrolle mit Software</A>
</H4>

<P>Lautst&auml;rkeregelung in Software wird mit dem <CODE>volume</CODE>-Filter
realisiert. Sei bei der Benutzung dieses Filters vorsichtig, da er den
Signal-zu-Rausch-Abstand verringern kann. In den meisten F&auml;llen ist es
besser, beim Mixer deiner Soundkarte den PCM-Regler auf's Maximum zu setzen und
diesen Filter wegzulassen. &Auml;ndere dann die Lautst&auml;rke mit dem
Hauptregler des Mixers.
Wenn deine Soundkarte einen digitalen PCM-Mixer anstelle eines analogen
besitzt und du Verzerrungen h&ouml;rst, dann benutze statt dessen den
MASTER-Mixer.
Wenn der Computer an einen externen Verst&auml;rker
angeschlossen ist (was meistens der Fall ist), dann kann der Rauschpegel
minimiert werden, indem der Hauptregler und der Lautst&auml;rkeregler des
Verst&auml;rkers angepasst werden, bis das Hintergrundzischen verschwunden ist.
Der Filter selber kennt zwei Parameter:</P>

<DL>
  <DT><CODE>v &lt;-200 - +60&gt;</CODE></DT>
  <DD>ist eine Flie&szlig;kommazahl zwischen <CODE>-200</CODE> und
    <CODE>+60</CODE> und gibt die Lautst&auml;rke in dB an. Der Standardlevel
    ist 0dB.</DD>

  <DT><CODE>c</CODE></DT>
  <DD>ist ein Bin&auml;rwert, der soft clipping an- oder ausschaltet.
    Soft clipping kann den Sound gl&auml;tten, wenn sehr laute Passagen
    auftreten. Aktivier diese Option, wenn die Dynamikbandbreite deiner
    Lautsprecher gering ist. Sei gewanrt, dass dieses Feature Verzerrungen
    hervorruft. Es sollte nur als letzte M&ouml;glichkeit benutzt werden.</DD>
</DL>

<P>Beispiel:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af volume=10.1:0 media.avi</CODE></P>

<P>verst&auml;rkt den Sound um 10.1dB und schneidet hart ab, wenn die
Lautst&auml;rke zu hoch wird.</P>

<P>Dieser Filter besitzt noch ein zweites Feature: Er misst die maximale
Lautst&auml;rke und gibt sie aus, wenn MPlayer beendet wird. Dieser Wert
kann benutzt werden, um die Verst&auml;rkung in MEncoder so zu setzen, dass
die Dynamikbandbreite vollst&auml;ndig ausgenutzt wird.</P>


<H4><A NAME="af_equalizer">2.3.2.3.6 Equalizer</A></H4>

<P>Der <CODE>equalizer</CODE>-Filter ist ein 10-Band Graphicequalizer, der
durch 10 IIR-Bandpassfilter (infinite impulse response, rekursive Filter)
realisiert wird. Das bedeutet, dass er unabh&auml;ngig vom wiederzugebenden
Audiotyp funktioniert. Die Mittenfrequenzen der zehn B&auml;ndern sind:</P>

<TABLE BORDER="0" WIDTH="100%">
  <TR><TD>Band Nr.</TD><TD>Mittenfrequenz</TD></TR>
  <TR><TD>0</TD><TD>31.25 Hz</TD></TR>
  <TR><TD>1</TD><TD>62.50 Hz</TD></TR>
  <TR><TD>2</TD><TD>125.0 Hz</TD></TR>
  <TR><TD>3</TD><TD>250.0 Hz</TD></TR>
  <TR><TD>4</TD><TD>500.0 Hz</TD></TR>
  <TR><TD>5</TD><TD>1.000 kHz</TD></TR>
  <TR><TD>6</TD><TD>2.000 kHz</TD></TR>
  <TR><TD>7</TD><TD>4.000 kHz</TD></TR>
  <TR><TD>8</TD><TD>8.000 kHz</TD></TR>
  <TR><TD>9</TD><TD>16.00 kHz</TD></TR>
</TABLE>

<P>Wenn die Samplefrequenz des Sounds niedriger als die Mittenfrequenz eines
Bandes ist, so wird dieses Band deaktiviert. Ein bekannter Fehler dieses
Filters liegt darin, dass die Charakteristiken des h&ouml;chsten Bandes nicht
ganz symmetrisch sind, wenn die Samplefrequenz nahe der Mittenfrequenz des
Bandes liegt. Das kann umgangen werden, wenn vorher ein Upsampling mit dem
resample-Filter vorgenommen wird.</P>

<P>Dieser Filter bekommt zehn Parameter:</P>

<DL>
  <DT><CODE>g1:g2:g3...g10</CODE></DT>
  <DD>sind Flie&szlig;kommazahlen zwischen <CODE>-12</CODE> und
    <CODE>+12</CODE>, die die Verst&auml;rkung in dB des jeweiligen Bandes
    angeben.</DD>
</DL>

<P>Beispiel:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af equalizer=11:11:10:5:0:-12:0:5:12:12 media.avi</CODE></P>

<P>verst&auml;rkt den Sound in den oberen und unteren Frequenzbereichen und
l&ouml;scht ihn um 1kHz beinahe komplett aus.</P>


<H4><A NAME="af_panning">2.3.2.3.7 Panning-Filter</A></H4>

<P>Der <CODE>pan</CODE>-Filter kann benutzt werden, um Kan&auml;le beliebig zu
mischen. Er ist grundlegend nur eine Kombination des Lautst&auml;rkefilters und
des channels-Filters. Es gibt zwei Haupteinsatzgebiete f&uuml;r diesen
Filter:</P>

<OL>
  <LI>Heruntermischen vieler Kan&auml;le auf wenige, z.B. Stereo zu Mono.</LI>
  <LI>Ver&auml;ndern der "Breite" des zentrierten Kanals bei
    Sourround-Sound-Systemem.</LI>
</OL>

<P>Dieser Filter ist nicht ganz leicht zu bedienen und ben&ouml;tigt viel
Ausprobieren, bevor die gew&uuml;nschten Ergebnisse erzielt werden. Die Anzahl
der Parameter h&auml;ngt von der Anzahl der Ausgabekan&auml;le ab:</P>

<DL>
  <DT><CODE>nch &lt;1-6&gt;</CODE></DT>
  <DD>ist eine ganze Zahl zwischen <CODE>1</CODE> und <CODE>6</CODE> und wird
    benutzt, um die Anzahl
    der Ausgabekan&auml;le zu setzen. Dieser Parameter wird ben&ouml;tigt.
    Wenn er weggelassen wird, erh&auml;lt man einen Laufzeitfehler.</DD>
  <DT><CODE>l00:l01:l02:..l10:l11:l12:...ln0:ln1:ln2:...</CODE></DT>
  <DD>sind Flie&szlig;kommazhalen zwischen <CODE>0</CODE> und
    <CODE>1</CODE>. <CODE>l[i][j]</CODE>
    gibt an, wieviel vom Einganskanal <CODE>j</CODE> in den Ausgabekanal
    <CODE>i</CODE> zu mischen ist.</DD>
</DL>

<P>Beispiel 1:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af pan=1:0.5:0.5 -channels 1 media.avi</CODE></P>

<P>mischt stereo auf mono.</P>


<P>Beispiel 2:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af pan=3:1:0:1:0.5:0.5 -channels 3
  media.avi</CODE></P>

<P>gibt drei Kan&auml;le aus, l&auml;sst dabei Kan&auml;le 0 und 1 intakt und
mischt die Quellkan&auml;le 0 und 1 in den Ausgabekanal 2 (welcher z.B. an
einen Sub-woofer geschickt werden kann).


<H4><A NAME="af_sub">2.3.2.3.8 Sub-woofer</A></H4>

<P>Der <CODE>sub</CODE>-Filter f&uuml;gt dem Audiostream einen Sub-woofer-Kanal
hinzu. Die dazu verwendeten Audiodaten sind der Durchschnitt der Kan&auml;le 0
und 1. Der resultierende Sound wird dann mit einem Butterworth-Filter vierten
Grades tiefpassgefiltert. Der Filter schneidet bei 60Hz ab. Warnung: deaktivier
diesen Filter, wenn du DVDs mit Dolby Digital 5.1-Sound abspielst, weil dieser
Filter ansonsten den bereits vorhandenen Sub-woofer-Kanal st&ouml;rt. Dieser
Filter bekommt zwei Parameter:</P>

<DL>
  <DT><CODE>fc &lt;20-300&gt;</CODE></DT>
  <DD>ist eine optionale Flie&szlig;kommazahl, die die Frequenz in Hz angibt,
    bei der Tiefpass abschneidet. G&uuml;ltig sind Werte ziwschen
    <CODE>20</CODE> und <CODE>300</CODE>. Das beste Ergebnis erh&auml;lst du,
    wenn du die Frequenz so niedrig wie m&ouml;glich setzt. Das wird das
    Stereo- und Surround-Sound-Erlebnis verbessern. Der Standardwert f&uuml;r
    die Frequenzgrenze liegt bei 60Hz.</DD>

  <DT><CODE>ch &lt;0-5&gt;</CODE></DT>
  <DD>ist eine optionale ganze Zahl zwischen <CODE>0</CODE> und <CODE>5</CODE>,
    die angibt, auf welchem Kanal der Sub-woofer-Kanal auszugeben ist.
    Der Standardkanal ist <CODE>5</CODE>. Die gesamte Anzahl an Kan&auml;len
    wird auf <CODE>ch</CODE> erh&ouml;ht, falls dies notwendig sein sollte.</DD>
</DL>

<P>Beispiel:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af sub=100:4 -channels 5 media.avi</CODE></P>

<P>f&uuml;gt einen Sub-woofer-Kanal mit Grenzfrequenz von 100Hz hinzu und gibt
ihn auf Kanal 4 aus.</P>


<H4><A NAME="af_surround">2.3.2.3.9 Surround-sound-Decoder</A></H4>

<P>Matrix encodierter Surround-Sound kann mit dem <CODE>surround</CODE>-Filter
decodiert werden. Dolby Surround ist ein Beispiel f&uuml;r ein matrix
encodiertes Format. Viele Dateien mit Zweikanalaudio enthalten tats&auml;chlich
matrix encodierten Surround-Sound. Um diesen Filter zu benutzen, brauchst du
eine Soundkarte, die mindestens vier Kan&auml;le unterst&uuml;tzt. Dieser
Filter kennt einen Parameter:</P>

<DL>
  <DT><CODE>d &lt;0-1000&gt;</CODE></DT>
  <DD>ist eine optionale Flie&szlig;kommazahl zwischen <CODE>0</CODE> und
    <CODE>1000</CODE>, die die Verz&ouml;gerung in ms f&uuml;r den hinteren
    Lautsprecher angibt. Die Verz&ouml;gerung soltle wie folgt gew&auml;hlt
    werden: Wenn d1 die Entfernung zwischen der Sitzposition und den vorderen
    Lautsprechern ist, und wenn d2 die Entfernung zwischen der Sitzposition
    und den hinteren Lautsprechern ist, dann sollte <CODE>d</CODE> auf
    15ms gesetzt werden, wenn d1 &lt;= d2 ist, und auf 15 + 5*(d1-d2), wenn
    d1 &gt; d2 ist. Der Standardwert <CODE>d</CODE> ist 20ms.</DD>
</DL>

<P>Beispiel:<BR>
  &nbsp;&nbsp;<CODE>mplayer -af surround=15 -channels 4 media.avi</CODE></P>

<P>decodiert Surround-Sound mit einer Verz&ouml;gerung von 15ms f&uuml;r die
hinteren Lautsprecher.</P>


<H4><A NAME="plugins">2.3.2.4 Audio-Plugins (veraltet)</A></H4>

<H2><STRONG>Anmerkung: Audioplugins sind veraltet und wurden durch Audiofilter
ersetzt. Sie werden bald entfernt werden.</STRONG></H2>

<P>MPlayer bietet Unterst&uuml;tzung f&uuml;r Audio-Plugins. Audio-
Plugins k&ouml;nnen benutzt werden, um die Einstellungen der Audio-Daten zu 
&auml;ndern, bevor sie die Soundkarte erreichen. Sie aktiviert durch die 
Option <CODE>-aop</CODE> aktiviert, welche 
<CODE>list=plugin1,plugin2,...</CODE> als Argument hat. Das <CODE>list</CODE> 
wird ben&ouml;tigt, um festzulegen, in welcher Reihenfolge die Plugins benutzt 
werden sollen. Beispiel:</P>

<P>&nbsp;&nbsp;<CODE>mplayer media.avi -aop list=resample,format</CODE></P>

<P>w&uuml;rde den Ton durch das Resampling-Plugin laufen lassen, gefolgt vom
Format-Plugins.</P>

<P>Die Plugins k&ouml;nnen auch Schalter haben, welche ihr Verhalten 
&auml;ndern. Diese Schalter werden im unteren Abschnitt im Detail beschrieben. 
Ein Plugin wird mit den Standardeinstellungen gestartet, wenn dem Plugin 
Optionen mitgegeben werden. Hier ist ein Beispiel, wie man Plugins in 
Kombination mit pluginspezifischen Schaltern verwendet:</P>

<P>&nbsp;&nbsp;<CODE>mplayer media.avi -aop 
list=resample,format:fout=44100:format=0x8</CODE></P>

<P>w&uuml;rde die Ausgabefrequenz des Resample-Plugins auf 44100Hz and das 
Ausgabeformat des Format-Plugins auf AFMT_U8 stellen.</P>
           
<P>Momentan k&ouml;nnen Audio-Plugins nicht im MEncoder verwendet 
werden.</P>
          
           
<H4><A NAME="resample">2.3.2.4.1 Up/Downsampling</A></H4>

<P>MPlayer unterst&uuml;tzt vollst&auml;ndiges up/downsampling von 
Audiostreams. Dieses Plugin kann verwendet werden, wenn man eine Soundkarte 
mit fester Frequenz besitzt, oder wenn man eine alte Soundkarte am Hals hat, 
welche nur max 44.1kHz verarbeitet. Ob die Verwendung dieses Plugins 
ben&ouml;tigt wird oder nicht erkennt MPlayer <B>automatisch</B>. 
Dieses Plugin hat einen Schalter, <CODE>fout</CODE>, welcher benutzt wird, um 
die gew&uuml;nschte Ausgabefrequenz zu setzen. Der Standard ist 48kHz und wird 
in &lt;Hz&gt; angegeben.</P>

<P>Verwendung:<BR> &nbsp;&nbsp;<CODE>mplayer medium.avi -aop 
list=resample:fout=&lt;erforderliche Frequenz in Hz, z.B. 44100&gt;</CODE></P>

<P>Hinweis: Die Ausgabefrequenz sollte nicht vom Standard-Wert hochskaliert 
werden. Die Skalierung f&uuml;hrt dazu, dass der Audio- und Video-Stream in 
Zeitlupe wiedergegeben werden, und man erh&auml;lt zus&auml;tzlich 
Audioverzerrungen.</P>


<H4><A NAME="surround_decoding">2.3.2.4.2 Surround-Sound-Decodierung</A></H4>

<P>MPlayer hat ein Audio-Plugin das matrix-codierten Surround Sound 
decodieren kann. Dolby Surround ist ein Beispiel eines matrix-codierten 
Formats. Viele Dateien mit zwei Audiokan&auml;len enthalten tats&auml;chlich 
matrix Surround Sound. Um dieses Feature zu benutzen, brauchst du eine 
Soundkarte mit mindestens vier Kan&auml;len.</P>

<P>Verwendung:<BR>
&nbsp;&nbsp;<CODE>mplayer medium.avi -aop list=surround</CODE></P>


<H4><A NAME="format">2.3.2.4.3 Sample-Format-Konvertierer</A></H4>

<P>Wenn deine Soundkarte keinen signed 16bit <CODE>int</CODE> Datentyp 
unterst&uuml;tzt, kann dieses Plugin benutzt werden, um das Format in eines zu 
&auml;ndern, das deine Soundkarte versteht. Es hat nur einen Schalter 
<CODE>format</CODE>, welcher auf eine Nummer gestellt werden kann, die man der 
Datei <CODE>libao2/afmt.h</CODE> findet. Dieses Plugin wird praktisch nie 
gebraucht und ist f&uuml;r erfahrene Anwender gedacht. Bedenke, dass dieses 
Plugin nur das Sampleformat und nicht die Samplefrequenz oder die Anzahl 
Kan&auml;le &auml;ndert.</P>

<P>Verwendung:<BR>
&nbsp;&nbsp;<CODE>mplayer medium.avi -aop
list=format:format=&lt;required output format&gt;</CODE></P>


<H4><A NAME="delay">2.3.2.4.4 Verz&ouml;gerung</A></H4>
  
<P>Dieses Plugin verz&ouml;gert den Ton und ist als Beispiel gedacht, wie man 
neue Plugins schreibt. Es kann f&uuml;r nichts sinnvolles aus der 
Anwenderperspektive verwendet werden und ist hier nur aus Gr&uuml;nden der 
Vollst&auml;ndigkeit erw&auml;hnt. Verwende dieses Plugin nicht, wenn du kein 
Entwickler bist.</P>

<P>Wenn du eine Datei mit einer konstanten A/V-Sync-Differenz hast, dann benutze
einfach die Tasten <CODE>+</CODE> und <CODE>-</CODE>, um das Timing w&auml;hrend
des Abspielens anzupassen. Wenn das OSD aktiviert ist, dann werden die aktuellen
Werte angezeigt, was die Anpassung erleichtert.</P>


<H4><A NAME="volume">2.3.2.4.5 Software Lautst&auml;rkeregelung</A></H4>

<P>Dieses Plugin ist ein Software-Ersatz f&uuml;r die Lautst&auml;rkereglung 
und kann in Maschinen mit kaputtem Mixer-Device verwendet werden. Es kann auch 
verwendet werden, um die Ausgabelautst&auml;rke von MPlayer zu 
&auml;ndern, ohne die Einstellung der PCM-Lautst&auml;rke im Mixer zu 
&auml;ndern. Es gibt einen Schalter <CODE>volume</CODE>, welcher verwendet 
wird, um den anf&auml;nglichen Schallpegel festzulegen. Der anf&auml;ngliche 
Schallpegel kann auf Werte zwischen 0 und 255 festgelegt werden (normal auf 
101, was 0db Verst&auml;rkung entspricht). Benutze dieses Plugin mit Vorsicht, 
da es den Signal/Rauschabstand verringern kann. In den meisten F&auml;llen ist 
es das beste, den Regler f&uuml;r PCM auf das Maximum zu stellen, 
dieses Plugin nicht zu verwenden und die Lautst&auml;rke zu deinen Boxen mit 
der Master-Lautst&auml;rkeregelung zu kontrollieren. Wenn deine Soundkarte
einen digitalen PCM-Mixer anstelle eines analogen verwendet und du Verzerrungen
h&ouml;rst, so verwende statt dessen den MASTER-Mixer. Wenn ein externer 
Verst&auml;rker mit dem Computer verbunden ist (was fast immer der Fall ist), 
kann der Ger&auml;uschepegel durch die Anpassung des Master-Stufe und der 
Lautst&auml;rkekn&ouml;pfe des Verst&auml;rkers minimiert werden, bis das 
Hintergrundrauschen verschwindet.</P>

<P>Verwendung:<BR>
&nbsp;&nbsp;<CODE>mplayer media.avi -aop
list=volume:volume=&lt;0-255&gt;</CODE></P>

<P>Dieses Plugin besitzt auch einen Kompressor oder "soft-clipping"-
F&auml;higkeiten. Die Kompression kann benutzt werden, wenn der Dynamikbereich 
des Sounds sehr hoch ist, oder wenn der Dynamikbereich der Lautsprecher sehr 
niedrig ist. Sei dir bewusst, dass dieses Feature Verzerrungen verursacht. Es 
sollte erst als letzte M&ouml;glichkeit in Betracht gezogen werden.</P>

<P>Verwendung:<BR>
&nbsp;&nbsp;<CODE>mplayer media.avi -aop
list=volume:softclip</CODE></P>


<H4><A NAME="extrastereo">2.3.2.4.6 Extrastereo</A></H4>

<P>Dieses Plugin erh&ouml;ht linear die Differenz zwischen dem linken und 
rechten Kanal (wie das XMMS Extrastereo-Plugin), was zum Teil zu "live"-
Effekten bei der Wiedergabe f&uuml;hrt.</P>

<P>Verwendung:<BR>
&nbsp;&nbsp;<CODE>mplayer media.avi -aop list=extrastereo</CODE><BR>
&nbsp;&nbsp;<CODE>mplayer media.avi -aop list=extrastereo:mul=3.45</CODE></P>

<P>Der Koeffizient (<CODE>mul</CODE>) ist eine Flie&szlig;kommazahl,
welche standardm&auml;&szlig;ig auf 2.5 gestellt ist. Wenn man den Wert auf 
0.0 setzt, erh&auml;lt man einen Mono-Ton (Durchschnitt beider Kan&auml;le). 
Wenn man den Wert auf 1.0 setzt, bleibt der Ton gleich. Wenn man den Wert auf 
-1.0 setzt, werden der linke und rechte Kanal vertauscht.</P>


<H4><A NAME="normalizer">2.3.2.4.7 Lautst&auml;rkenormalisierer</A></H4>

<P>Dieses Plugin maximiert die Lautst&auml;rke, ohne den Ton zu 
verzerren.</P>

<P>Verwendung:<BR>
&nbsp;&nbsp;<CODE>mplayer media.avi -aop list=volnorm</CODE></P>


</BODY>
</HTML>
